import React from 'react'
export function MainPage() {
  return (
    <div
      style={{
        backgroundImage: 'url("/img/img_1.png")',
        backgroundSize: 'cover',
        minHeight: '80%',
        textAlign: 'center',
        paddingTop: '50px',
        lineHeight: '40px'
      }}
    >
      <p>Даний сервіс створений для зручності всіх мешканців та гостей нашого міста.</p>
      <p>На цьому сайті Ви зможете знайти адреса всіх парковок міста</p>
      <p>Переглянути розташування парковок на карті міста</p>
      <p>Також Ви можете отримати всю необхідну Вам інформацію про кожну парковку: наявність вільних місць, час роботи, вартість</p>
      <p>Додатково є можливість побудувати маршрут до обраної Вами парковки та забронювати там собі місце на найближчій час</p>
      <p>Для покращення пошуку на карті організована функція пошуку по адресі чи по назві потрібного місця призначення</p>
    </div>
  )
}
